---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures.ReferenceToLocalFile
source: html/ed4c1781-63bc-3465-e14a-f989c8251040.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures.ReferenceToLocalFile Property

The External Resource refers to a local file that may not be available to workshared users.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReferenceToLocalFile { get; }
```